{
    "CE2": {
        "mathematiques": {
            "nombres_et_calculs": {
                "nom": "Nombres et Calculs",
                "competences": "L'élève doit savoir lire, écrire et comparer les nombres jusqu'à 1000. Il doit maîtriser les tables d'addition et de multiplication (x2, x3, x4, x5, x10). Il doit savoir poser et calculer des additions et soustractions en colonnes. Il doit pouvoir résoudre des problèmes simples impliquant ces opérations."
            },
            "problemes": {
                "nom": "Résolution de Problèmes",
                "competences": "L'élève doit être capable de résoudre des problèmes à une ou plusieurs étapes relevant des structures additives et soustractives. Il doit apprendre à modéliser la situation à l'aide d'un schéma ou d'un calcul."
            },
            "geometrie": {
                "nom": "Géométrie",
                "competences": "L'élève doit savoir reconnaître, nommer et décrire des figures simples comme le carré, le rectangle, le triangle. Il doit être capable de tracer des segments et de reporter des longueurs."
            },
            "grandeurs_et_mesures": {
                "nom": "Grandeurs et Mesures",
                "competences": "L'élève doit savoir lire l'heure sur une horloge à aiguilles. Il doit connaître les unités de longueur (m, cm) et de masse (g, kg) et savoir les utiliser pour mesurer."
            }
        },
        "francais": {
            "conjugaison": {
                "nom": "Conjugaison",
                "competences": "L'élève doit savoir conjuguer les verbes du 1er groupe, ainsi que les verbes être et avoir au présent de l'indicatif. Il doit identifier le verbe dans la phrase et son infinitif."
            },
            "grammaire": {
                "nom": "Grammaire",
                "competences": "L'élève doit savoir identifier le nom et le verbe dans une phrase simple. Il doit comprendre et appliquer les accords simples dans le groupe nominal (déterminant, nom, adjectif)."
            },
            "orthographe": {
                "nom": "Orthographe",
                "competences": "L'élève doit connaître l'orthographe des mots fréquents. Il doit savoir utiliser les homophones grammaticaux courants (a/à, est/et, son/sont, on/ont)."
            },
            "comprehension": {
                "nom": "Compréhension de texte",
                "competences": "L'élève doit être capable de lire un texte court et de répondre à des questions simples sur les informations explicites du texte (qui, quoi, où, quand)."
            }
        },
        "sciences": {
            "le_vivant": {
                "nom": "Le Monde du Vivant",
                "competences": "L'élève doit savoir identifier et classer les animaux selon leur régime alimentaire (carnivore, herbivore, omnivore). Il doit comprendre les chaînes alimentaires simples."
            }
        },
        "anglais": {
            "lexique_base": {
                "nom": "Lexique de base",
                "competences": "L'élève doit connaître le vocabulaire de base : couleurs, animaux, nombres jusqu'à 10, objets de la classe. Il doit savoir se présenter simplement (My name is...)."
            },
            "structures_simples": {
                "nom": "Structures simples",
                "competences": "L'élève doit savoir poser des questions simples comme 'What is your name?' ou 'How are you?'. Il doit pouvoir exprimer ses goûts avec 'I like...' et 'I don't like...'."
            }
        },
        "arabe": {
            "alphabet": {
                "nom": "Alphabet et Sons",
                "competences": "L'élève doit commencer à reconnaître et à tracer les lettres de l'alphabet arabe. Il doit associer les lettres aux sons correspondants."
            },
            "vocabulaire_usuel": {
                "nom": "Vocabulaire usuel",
                "competences": "L'élève doit apprendre les mots de salutation de base, les chiffres de 1 à 10 et le nom de quelques objets familiers."
            }
        }
    }
}

